GopalSaraf/Practicals/PSDL/include/proc/pic16f18054.inc
// Register: T1CLK
#define T1CLK T1CLK
T1CLK                                    equ 0291h
// bitfield definitions
T1CLK_CS_POSN                            equ 0000h
T1CLK_CS_POSITION                        equ 0000h
T1CLK_CS_SIZE                            equ 0008h
T1CLK_CS_LENGTH                          equ 0008h
T1CLK_CS_MASK                            equ 00FFh
T1CLK_T1CS0_POSN                         equ 0000h
T1CLK_T1CS0_POSITION                     equ 0000h
T1CLK_T1CS0_SIZE                         equ 0001h
T1CLK_T1CS0_LENGTH                       equ 0001h
T1CLK_T1CS0_MASK                         equ 0001h
T1CLK_T1CS1_POSN                         equ 0001h
T1CLK_T1CS1_POSITION                     equ 0001h
T1CLK_T1CS1_SIZE                         equ 0001h
T1CLK_T1CS1_LENGTH                       equ 0001h
T1CLK_T1CS1_MASK                         equ 0002h
T1CLK_T1CS2_POSN                         equ 0002h
T1CLK_T1CS2_POSITION                     equ 0002h
T1CLK_T1CS2_SIZE                         equ 0001h
T1CLK_T1CS2_LENGTH                       equ 0001h
T1CLK_T1CS2_MASK                         equ 0004h
T1CLK_T1CS3_POSN                         equ 0003h
T1CLK_T1CS3_POSITION                     equ 0003h
T1CLK_T1CS3_SIZE                         equ 0001h
T1CLK_T1CS3_LENGTH                       equ 0001h
T1CLK_T1CS3_MASK                         equ 0008h
T1CLK_T1CS4_POSN                         equ 0004h
T1CLK_T1CS4_POSITION                     equ 0004h
T1CLK_T1CS4_SIZE                         equ 0001h
T1CLK_T1CS4_LENGTH                       equ 0001h
T1CLK_T1CS4_MASK                         equ 0010h
T1CLK_CS0_POSN                           equ 0000h
T1CLK_CS0_POSITION                       equ 0000h
T1CLK_CS0_SIZE                           equ 0001h
T1CLK_CS0_LENGTH                         equ 0001h
T1CLK_CS0_MASK                           equ 0001h
T1CLK_CS1_POSN                           equ 0001h
T1CLK_CS1_POSITION                       equ 0001h
T1CLK_CS1_SIZE                           equ 0001h
T1CLK_CS1_LENGTH                         equ 0001h
T1CLK_CS1_MASK                           equ 0002h
T1CLK_CS2_POSN                           equ 0002h
T1CLK_CS2_POSITION                       equ 0002h
T1CLK_CS2_SIZE                           equ 0001h
T1CLK_CS2_LENGTH                         equ 0001h
T1CLK_CS2_MASK                           equ 0004h
T1CLK_CS3_POSN                           equ 0003h
T1CLK_CS3_POSITION                       equ 0003h
T1CLK_CS3_SIZE                           equ 0001h
T1CLK_CS3_LENGTH                         equ 0001h
T1CLK_CS3_MASK                           equ 0008h
T1CLK_CS4_POSN                           equ 0004h
T1CLK_CS4_POSITION                       equ 0004h
T1CLK_CS4_SIZE                           equ 0001h
T1CLK_CS4_LENGTH                         equ 0001h
T1CLK_CS4_MASK                           equ 0010h

// Register: TMR3L
#define TMR3L TMR3L
TMR3L                                    equ 0292h
// bitfield definitions
TMR3L_TMR3L_POSN                         equ 0000h
TMR3L_TMR3L_POSITION                     equ 0000h
TMR3L_TMR3L_SIZE                         equ 0008h
TMR3L_TMR3L_LENGTH                       equ 0008h
TMR3L_TMR3L_MASK                         equ 00FFh
TMR3L_TMR3L0_POSN                        equ 0000h
TMR3L_TMR3L0_POSITION                    equ 0000h
TMR3L_TMR3L0_SIZE                        equ 0001h
TMR3L_TMR3L0_LENGTH                      equ 0001h
TMR3L_TMR3L0_MASK                        equ 0001h
TMR3L_TMR3L1_POSN                        equ 0001h
TMR3L_TMR3L1_POSITION                    equ 0001h
TMR3L_TMR3L1_SIZE                        equ 0001h
TMR3L_TMR3L1_LENGTH                      equ 0001h
TMR3L_TMR3L1_MASK                        equ 0002h
TMR3L_TMR3L2_POSN                        equ 0002h
TMR3L_TMR3L2_POSITION                    equ 0002h
TMR3L_TMR3L2_SIZE                        equ 0001h
TMR3L_TMR3L2_LENGTH                      equ 0001h
TMR3L_TMR3L2_MASK                        equ 0004h
TMR3L_TMR3L3_POSN                        equ 0003h
TMR3L_TMR3L3_POSITION                    equ 0003h
TMR3L_TMR3L3_SIZE                        equ 0001h
TMR3L_TMR3L3_LENGTH                      equ 0001h
TMR3L_TMR3L3_MASK                        equ 0008h
TMR3L_TMR3L4_POSN                        equ 0004h
TMR3L_TMR3L4_POSITION                    equ 0004h
TMR3L_TMR3L4_SIZE                        equ 0001h
TMR3L_TMR3L4_LENGTH                      equ 0001h
TMR3L_TMR3L4_MASK                        equ 0010h
TMR3L_TMR3L5_POSN                        equ 0005h
TMR3L_TMR3L5_POSITION                    equ 0005h
TMR3L_TMR3L5_SIZE                        equ 0001h
TMR3L_TMR3L5_LENGTH                      equ 0001h
TMR3L_TMR3L5_MASK                        equ 0020h
TMR3L_TMR3L6_POSN                        equ 0006h
TMR3L_TMR3L6_POSITION                    equ 0006h
TMR3L_TMR3L6_SIZE                        equ 0001h
TMR3L_TMR3L6_LENGTH                      equ 0001h
TMR3L_TMR3L6_MASK                        equ 0040h
TMR3L_TMR3L7_POSN                        equ 0007h
TMR3L_TMR3L7_POSITION                    equ 0007h
TMR3L_TMR3L7_SIZE                        equ 0001h
TMR3L_TMR3L7_LENGTH                      equ 0001h
TMR3L_TMR3L7_MASK                        equ 0080h
TMR3L_TMR30_POSN                         equ 0000h
TMR3L_TMR30_POSITION                     equ 0000h
TMR3L_TMR30_SIZE                         equ 0001h
TMR3L_TMR30_LENGTH                       equ 0001h
TMR3L_TMR30_MASK                         equ 0001h
TMR3L_TMR31_POSN                         equ 0001h
TMR3L_TMR31_POSITION                     equ 0001h
TMR3L_TMR31_SIZE                         equ 0001h
TMR3L_TMR31_LENGTH                       equ 0001h
TMR3L_TMR31_MASK                         equ 0002h
TMR3L_TMR32_POSN                         equ 0002h
TMR3L_TMR32_POSITION                     equ 0002h
TMR3L_TMR32_SIZE                         equ 0001h
TMR3L_TMR32_LENGTH                       equ 0001h
TMR3L_TMR32_MASK                         equ 0004h
TMR3L_TMR33_POSN                         equ 0003h
TMR3L_TMR33_POSITION                     equ 0003h
TMR3L_TMR33_SIZE                         equ 0001h
TMR3L_TMR33_LENGTH                       equ 0001h
TMR3L_TMR33_MASK                         equ 0008h
TMR3L_TMR34_POSN                         equ 0004h
TMR3L_TMR34_POSITION                     equ 0004h
TMR3L_TMR34_SIZE                         equ 0001h
TMR3L_TMR34_LENGTH                       equ 0001h
TMR3L_TMR34_MASK                         equ 0010h
TMR3L_TMR35_POSN                         equ 0005h
TMR3L_TMR35_POSITION                     equ 0005h
TMR3L_TMR35_SIZE                         equ 0001h
TMR3L_TMR35_LENGTH                       equ 0001h
TMR3L_TMR35_MASK                         equ 0020h
TMR3L_TMR36_POSN                         equ 0006h
TMR3L_TMR36_POSITION                     equ 0006h
TMR3L_TMR36_SIZE                         equ 0001h
TMR3L_TMR36_LENGTH                       equ 0001h
TMR3L_TMR36_MASK                         equ 0040h
TMR3L_TMR37_POSN                         equ 0007h
TMR3L_TMR37_POSITION                     equ 0007h
TMR3L_TMR37_SIZE                         equ 0001h
TMR3L_TMR37_LENGTH                       equ 0001h
TMR3L_TMR37_MASK                         equ 0080h
TMR3L_CAL03_POSN                         equ 0000h
TMR3L_CAL03_POSITION                     equ 0000h
TMR3L_CAL03_SIZE                         equ 0001h
TMR3L_CAL03_LENGTH                       equ 0001h
TMR3L_CAL03_MASK                         equ 0001h
TMR3L_CAL13_POSN                         equ 0001h
TMR3L_CAL13_POSITION                     equ 0001h
TMR3L_CAL13_SIZE                         equ 0001h
TMR3L_CAL13_LENGTH                       equ 0001h
TMR3L_CAL13_MASK                         equ 0002h
TMR3L_CAL23_POSN                         equ 0002h
TMR3L_CAL23_POSITION                     equ 0002h
TMR3L_CAL23_SIZE                         equ 0001h
TMR3L_CAL23_LENGTH                       equ 0001h
TMR3L_CAL23_MASK                         equ 0004h
TMR3L_CAL33_POSN                         equ 0003h
TMR3L_CAL33_POSITION                     equ 0003h
TMR3L_CAL33_SIZE                         equ 0001h
TMR3L_CAL33_LENGTH                       equ 0001h
TMR3L_CAL33_MASK                         equ 0008h
TMR3L_CAL43_POSN                         equ 0004h
TMR3L_CAL43_POSITION                     equ 0004h
TMR3L_CAL43_SIZE                         equ 0001h
TMR3L_CAL43_LENGTH                       equ 0001h
TMR3L_CAL43_MASK                         equ 0010h
TMR3L_CAL53_POSN                         equ 0005h
TMR3L_CAL53_POSITION                     equ 0005h
TMR3L_CAL53_SIZE                         equ 0001h
TMR3L_CAL53_LENGTH                       equ 0001h
TMR3L_CAL53_MASK                         equ 0020h
TMR3L_CAL63_POSN                         equ 0006h
TMR3L_CAL63_POSITION                     equ 0006h
TMR3L_CAL63_SIZE                         equ 0001h
TMR3L_CAL63_LENGTH                       equ 0001h
TMR3L_CAL63_MASK                         equ 0040h
TMR3L_CAL73_POSN                         equ 0007h
TMR3L_CAL73_POSITION                     equ 0007h
TMR3L_CAL73_SIZE                         equ 0001h
TMR3L_CAL73_LENGTH                       equ 0001h
TMR3L_CAL73_MASK                         equ 0080h

